/* ====================================================================== *
 *  ファイル名  : ROVND_GetKind.c
 *  概要        : アイテムの種類を取得する
 *  作成者      : clown
 *  修正日      : 2003/11/23
 * ====================================================================== */
#include <stdlib.h>
#include <string.h>
#include "ROVND_Proto.h"

/* ====================================================================== *
 *  関数名      : GetKind
 *  機能        : アイテムの種類を取得する
 *  戻り値
 *    非負整数  : アイテムの種類
 *    -1        : エラー
 *  修正日      : 2003/11/23
 * ====================================================================== */
int GetKind(char *element)
{
    int i;

    if (element != NULL) {
        for (i = 0; i < g_kindnum; i++) {
            if (strcmp(element, g_itemkind[i]) == 0) {
                return i;
            }
        }
    }

    return -1;
}
