/* ====================================================================== *
 *  ファイル名  : ROVND_Define.c
 *  概要        : アイテムデータに関する定義ファイル
 *  作成者      : clown
 *  修正日      : 2003/11/25
 * ====================================================================== */
int  g_kindnum = 10;
char g_itemkind[][4] = {
    "DGR",      // 短剣
    "SWD",      // 片手剣
    "WSD",      // 両手剣
    "SPR",      // 槍
    "AXE",      // 斧
    "MAC",      // 鈍器
    "ROD",      // 杖
    "BOW",      // 弓
    "KTL",      // カタール
    "BOK",      // 本
    "CLW",      // 爪
    "MSC",      // 楽器
    "WHP"       // 鞭
};

char g_j_itemkind[][256] = {
    "短剣",
    "片手剣",
    "両手剣",
    "槍",
    "斧",
    "鈍器",
    "杖",
    "弓",
    "カタール",
    "本",
    "爪",
    "楽器",
    "鞭"
};
